app/Controllers/Login.php

SELECT `Droits`
FROM `utilisateurs`
WHERE `pseudo` = 'mitsunari'
---
    public function setSessionDroit($pseudo){
        $db = \Config\Database::connect();
        $builder = $db->table("utilisateurs");

        $builder->select('Droits');
        $builder->where("pseudo", $pseudo);
        $res = $builder->get();

SELECT `Pseudo`
FROM `utilisateurs`
WHERE `pseudo` != 'mitsunari'
---
    public function canSendTo($pseudo){
        $db = \Config\Database::connect();
        $builder = $db->table("utilisateurs");

        $builder->select('Pseudo');
        $builder->where('pseudo != ', $pseudo);
        $res = $builder->get();

SELECT `id_utilisateur`
FROM `utilisateurs`
WHERE `Pseudo` = 'mitsunari'
---
    public function setSessionId($pseudo){
        $db = \Config\Database::connect();
        $builder = $db->table("utilisateurs");

        $builder->select('id_utilisateur');
        $builder->where('Pseudo', $pseudo);
        $res = $builder->get();