app/Controllers/Message.php

SELECT `sujet`, `contenue`, `message`.`idEmetteur` as `emetteur`, `message`.`dateEnvoie` as `date`
FROM `message`
JOIN `utilisateurs` ON `message`.`idDestinataire` = `utilisateurs`.`id_utilisateur`
WHERE (`message`.`idDestinataire` = 2 AND `message`.`idEmetteur` = 1) OR 
            (`message`.`idDestinataire` = 1 AND `message`.`idEmetteur` = 2)
---
        public function setMessage(){
            $db = \Config\Database::connect();
            $builder = $db->table("message");

            $this->setIdReciever($_SESSION['reciever']);
            $where = "(message.idDestinataire = ".$_SESSION['idRecieve']." AND message.idEmetteur = ".$_SESSION['id'].") OR
            (message.idDestinataire = ".$_SESSION['id']." AND message.idEmetteur = ".$_SESSION['idRecieve'].")";

            $builder->select("sujet,contenue,message.idEmetteur as emetteur,message.dateEnvoie as date");
            $builder->join("utilisateurs", "message.idDestinataire = utilisateurs.id_utilisateur");
            $builder->where($where);

            $tab = [];
            $res = $builder->get();

SELECT `id_utilisateur`
FROM `utilisateurs`
WHERE `pseudo` = 'Nemeiz'
---
        public function setIdReciever($recieve){
            $db = \Config\Database::connect();
            $builder = $db->table("utilisateurs");

            $builder->select("id_utilisateur");
            $builder->where("pseudo", $recieve);
            $res = $builder->get();

INSERT INTO `message` (`idEmetteur`, `idDestinataire`, `localisation`, `sujet`, `contenue`) VALUES ('1', '2', '0.000;0.000', 'Projet', 'HEY HEY HEY')
---
        public function send(){
            session_start();
            $db = \Config\Database::connect();
            $builder = $db->table("message");

            $data = array(
                "idEmetteur" => $_SESSION['id'],
                "idDestinataire" => $_SESSION['idRecieve'],
                "localisation" => "0.000;0.000",
                "sujet" => $this->request->getVar("sujet"),
                "contenue" => $this->request->getVar("content")
            );
            $builder->insert($data);